#!/usr/bin/env python
# coding: utf-8

# In[9]:


import pandas as pd


# In[13]:


my_series2 = pd.Series([5, 6, 7, 8], index=['a', 'b', 'c', 'e'])
my_series2[['a', 'b', 'e']]=0
my_series2


# In[18]:


my_series3 = pd.Series({'Россия':'Москва', 'Германия':'Берлин'})
my_series3['Германия']
                       


# In[39]:


df= pd.DataFrame({
    'продукты':['хлеб', 'булка', 'кефир', 'сыр', 'шоколад'],
    'кол-во':[1, 2, 1, 0.2, 1],
    'цена' :[32, 15, 70, 450, 75]
})
df['осталось']=df['кол-во']*df['цена']
df


# In[41]:


df= pd.DataFrame({
    '8классы':['A', 'Б', 'B', 'Г', 'Д', 'К'],
    'кол-во учеников':[12, 10, 16, 11, 8, 17],
})
df['кол-во съединных яблок']=df['кол-во учеников']*3
df  


# In[ ]:




